// Πρόγραµµα για απλό πειραµατισµό µε φωτοαντιστάτη
int a; // εδώ θα κρατάµε την τιµή που διαβάζουµε από τον φωτοαντιστάτη
float b; // εδώ θα αποθηκεύουµε την τάση που έχει ο φωτοαντιστάτης στα άκρα του
float c; // εδώ θα αποθηκεύουµε την τιµή της αντίστασης του φωτοαντιστάτη
void setup() {
 Serial.begin(9600); // ξεκινάµε το σειριακό µόνιτορ του Arduino IDE
 }
 
 void loop() {
 a=analogRead(A0); // διάβασε την τιµή της τάσης στην αναλογική είσοδο A0
 Serial.print("Τιµή: ");
 Serial.print(a); // απεικόνισε την τιµή της a στο σειριακό µόνιτορ του Arduino IDΕ
 Serial.print("\t");

 b=a*5.0/1023; // υπολόγισε την τιµή της τάσης στα άκρα του φωτοαντιστάτη (αντιστοιχία: 1023 --> 5V)
 Serial.print("Τάση: ");
 Serial.print(b); // απεικόνισε την τιµή της τάσης
 Serial.print(" V \t");
 c=b*10.0/(5-b); // υπολόγισε την αντίσταση του φωτοαντιστάτη σε kΩ

 Serial.print(c);
 Serial.println(" kΩ");

 delay(500); // περίµενε εδώ 0,5 δευτερόλεπτο
}
